app/views/posts/show.html.erb

            <p class="bg-secondary-subtle"><%= @post.body %></p>
            <p class="text-muted"><%= @post.created_at.strftime("%F") %> Escrito por: <%= @post.author.capitalize %></p>
---
INSERT INTO "posts" ("title", "body", "author", "text", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"