app/controllers/posts_controller.rb

    def index
		@posts = Posts.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

    def create
        @posts = Posts.new(post_params)
        if @posts.save
---
INSERT INTO "posts" ("title", "body", "author", "text", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "d"], ["body", "d"], ["author", "d"], ["text", "d"], ["image", "d"], ["created_at", "2023-01-28 04:10:25.811633"], ["updated_at", "2023-01-28 04:10:25.811633"]]

    def show
        @post = Posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def destroy
        @post = Posts.find(params[:id])
        @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 16]]